package com.ly.sock5.handler;


/**
 *+---------+-----------------+------------------+
  |协议版本  | 支持的验证式数量   | 验证方式          |
  +---------+-----------------+------------------+
  |1个字节   | 1个字节          | 1种式占一个字节    |
  +---------+-----------------+------------------+
  |0x05     |0x02             |0x00,0x02         |
  +---------+-----------------+------------------+
  客户端告诉代理服务器自已支持两种验证方式。
	0x00 无验证需求
	0x01 通用安全服务应用程序接口(GSSAPI)
	0x02 用户名/密码(USERNAME/PASSWORD)
	0x03 至 X’7F’ IANA 分配(IANA ASSIGNED)
	0x80 至 X’FE’ 私人方法保留(RESERVED FOR PRIVATE METHODS)
	0xFF 无可接受方法(NO ACCEPTABLE METHODS)
	     代理服务器收到上面的报文，选择自已所能支持的验证方式,并返回相应的数所包
	  +----------+------------------+
	  |协议版本   |  支持的验证方式     |
	  +----------+------------------+
	  |1个字节    |  1个字节          |
	  +----------+------------------+
	  |0x05      |  0x00            |
	  +----------+------------------+
  
 * @author liyang
 *
 */
public interface SocksHandler {
}
